<?php
/*
uniqid (prefix (Optinal) , More_Entropy (Optinal));
Unique Identifier 
*/
echo "<h2> Exp No.1  ( uniqid )  </h2>";
// لا يستخدم فى الحماية او التشفير للبيانات
$Randoom = uniqid(); // رقم فريد عشوائى من 13 حرف فى كل مره

echo $Randoom . '<br>'; // سوف يقوم بطباعة قمية النتغير وهى 13 رقم عشوائى فى كل مره
var_dump($Randoom );

/////////////////////////////////////////////
echo "<h2> Exp No.2  ( prefix )  </h2>";

$Randoom = uniqid('Script No.1   '); // يضع عنوان للرقم الفريد حتى يستحيل اى رقمين يكونوا منتشابهين
echo $Randoom . '<br>'; // سوف يقوم بطباعة قمية النتغير وهى 13 رقم عشوائى فى كل مره
var_dump($Randoom );
//////////////////////////////////////
echo "<h2> Exp No.3  ( More_Entropy )  </h2>";

$Randoom = uniqid('',TRUE); // هذا الامر لو وضعناه فى وضع صح سوف يقوم بعمل عشوائية اضافية على الرقم العشوائى ليصبح 23 رقم عشوائ
echo $Randoom . '<br>'; // سوف يقوم بطباعة قمية النتغير وهى 13 رقم عشوائى فى كل مره
var_dump($Randoom );
//////////////////////////////////////////////////
